{
    "meta": {
        "description": {
            "main": "I am an experienced React frontend developer specializing in responsive and modern websites. Check out my portfolio to learn more!",
            "contact": "Get in touch with me! Fill out the contact form or email me directly.",
            "projects": "See examples of projects. From modern websites to complex web applications.",
            "aboutMe": "Meet Max Szymański, an experienced frontend developer specializing in creating modern websites. Read about my skills, experience, and passion for coding.",
            "errorPage": "Sorry, the page you are looking for cannot be found. Please check the URL or return to the homepage to continue browsing our site."
        },
        "errorPageTitle": "Page not found"
    },
    "header": {
        "hi": "Hello",
        "welcome": "I'm Max, an experienced ",
        "introduction": "I combine creativity with technology, delivering modern and effective web solutions.",
        "workingon": "Currently working on",
        "contactme": "Contact me!",
        "alt": "picture of hacker"
    },
    "nav": {
        "home": "Home",
        "projects": "Projects",
        "contact": "Contact",
        "aboutMe": "About me",
        "switcher": "Choose language"
    },

    "section": {
        "fun": "Curiosities",
        "skills": "Skills"
    },
    "aboutMe": {
        "hello": "Hello, I'm Max!",
        "one": "I am a front-end developer with one and a half years of experience. My adventure with coding started out of curiosity and turned into a passion. I have worked on a variety of projects, from simple business card pages to advanced web applications, gaining valuable experience with clients.",
        "two": "I create responsive, intuitive and aesthetically pleasing websites and web applications, taking care of every detail from interface design to implementation of the finished product.",
        "three": "I am open to new challenges and always ready to learn, believing that technical proficiency, creativity and continuous development are key to success in this industry.",
        "more": "Read more ->"
    },
    "projects": {
        "paintedSmile": "Painted Smile",
        "rockPaper": "Rock Paper Scissors",
        "aboutBurrito": "An app for ordering food from restaurants with features for creating an account, editing a profile and viewing order history.",
        "aboutPainted": "Children's animation company website, with an intuitive interface, information about services and a photo gallery.",
        "aboutPortfolio": "A portfolio site with detailed descriptions of my projects, information about me and contact information with and form.",
        "aboutEltom": "A website an electrical company, with a modern design,  designed by me, information about services and a contact form.",
        "aboutExplorer": "An interactive application that allows users to explore different countries around the world. ",
        "aboutSpace": "A site dedicated to space travel, created as an internship. Includes information on space missions and technologies.",
        "aboutOasis": "An app for managing prices and hotel reservations, along with displaying statistics. Developed as part of a training project.",
        "aboutRock": "Classic rock paper scissors game. Choose your move and face your opponent in this simple but addictive game.",
        "viewAll": "view all ->",
        "live": "Live ->",
        "livePhone": "Live ->",
        "code": "Code ->",
        "alt": "Photo of project"
    },
    "skills": {
        "languages": "Languages",
        "frameworks": "Frameworks",
        "tools": "Tools",
        "database": "Database and Libraries",
        "other": "Other"
    },
    "contact": {
        "contactText": "Do you have questions about my work, want to collaborate or hire me for your project? Get in touch with me! I will be happy to answer any questions.",
        "contactMe": "Contact me",
        "labelName": "Name / Company name",
        "labelEmail": "Email",
        "labelMessage": "Message",
        "send": "Send",
        "sending": "Sending ...",
        "errorName": "Please provide the name or company name",
        "errorEmail": "Please provide a valid email address",
        "errorMessage": "Please enter the text of the message",
        "contactDetails": "Contact details"
    },

    "fun": {
        "one": "I love Italian food",
        "two": "I like to experiment in the kitchen",
        "three": "My favourite film is Inception",
        "four": "I like solving puzzles",
        "five": "I enjoy tinkering and fixing things",
        "six": "I love exploring new countries",
        "seven": "I regularly cycle and play football"
    },
    "modal": {
        "success": {
            "title": "Success!",
            "message": "Your message has been sent successfully."
        },
        "error": {
            "title": "Error",
            "message": "Your message could not be sent. Please try again later."
        }
    },
    "cookie": {
        "textOne": "We use cookies on the site to collect traffic data.",
        "textTwo": "For more information, see the",
        "link": "privacy policy",
        "accept": "Accept"
    },
    "errorPage": {
        "title": "Page not found!",
        "link": "<- Go to homepage"
    },
    "quotes": {
        "one": {
            "quote": "Code is like humor. When you have to explain it, it’s bad.",
            "author": "Cory House"
        },
        "two": {
            "quote": "Success is the sum of small efforts, repeated day in and day out.",
            "author": "Robert Collier"
        },
        "three": {
            "quote": "Experience is the name everyone gives to their mistakes.",
            "author": "Oscar Wilde"
        },
        "four": {
            "quote": "In order to be irreplaceable, one must always be different.",
            "author": "Coco Chanel"
        },
        "five": {
            "quote": "Choose a job you love, and you will never have to work a day in your life.",
            "author": "Confucius"
        },
        "six": {
            "quote": "Programming isn't about what you know, it's about what you can figure out.",
            "author": "Chris Pine"
        },
        "seven": {
            "quote": "Believe you can and you're halfway there.",
            "author": "Theodore Roosevelt"
        },
        "eight": {
            "quote": "The journey of a thousand miles begins with one step.",
            "author": "Lao Tzu"
        },
        "nine": {
            "quote": "If you can dream it, you can do it.",
            "author": "Walt Disney"
        },
        "ten": {
            "quote": "Failure is simply the opportunity to begin again, this time more intelligently.",
            "author": "Henry Ford"
        },
        "eleven": {
            "quote": "The only limit to our realization of tomorrow is our doubts of today.",
            "author": "Franklin D. Roosevelt"
        },
        "twelve": {
            "quote": "Live as if you were to die tomorrow. Learn as if you were to live forever.",
            "author": "Mahatma Gandhi"
        }
    }
}
