{
    "meta": {
        "description": {
            "main": "Jestem doświadczonym React frontend developerem specjalizującym się w tworzeniu responsywnych i nowoczesnych stron internetowych. Sprawdź moje portfolio, aby dowiedzieć się więcej!",
            "contact": "Skontaktuj się ze mną! Wypełnij formularz kontaktowy lub napisz bezpośrednio na email.",
            "projects": "Zobacz przykłady projektów. Od nowoczesnych stron internetowych po złożone aplikacje webowe.",
            "aboutMe": "Poznaj Max Szymański, doświadczonego frontend developera specjalizującego się w tworzeniu nowoczesnych stron internetowych. Przeczytaj o moich umiejętnościach, doświadczeniu i pasji do kodowania.",
            "errorPage": "Niestety, strona, której szukasz, nie została znaleziona. Sprawdź, czy adres URL jest poprawny, lub wróć na stronę główną, aby kontynuować przeglądanie naszej witryny."
        },
        "errorPageTitle": "Strona nie znaleziona"
    },
    "header": {
        "hi": "Witaj",
        "welcome": "Jestem Max ",
        "introduction": "Łączę kreatywność z technologią, dostarczając nowoczesne i efektywne rozwiązania webowe.",
        "workingon": "Obecnie pracuję nad",
        "contactme": "Skontaktuj się!",
        "alt": "zdjęcie hackera"
    },
    "nav": {
        "home": "Strona główna",
        "projects": "Projekty",
        "contact": "Kontakt",
        "aboutMe": "O mnie",
        "switcher": "Wybierz język"
    },
    "section": {
        "fun": "Ciekawostki",
        "skills": "Umiejętności"
    },
    "aboutMe": {
        "hello": "Cześć, jestem Max!",
        "one": "Jestem front-end developerem z ponad 2,5-letnim doświadczeniem. Moja przygoda z kodowaniem zaczęła się z ciekawości, a szybko przerodziła się w pasję.  Pracowałem nad wieloma projektami, od prostych stron wizytówek po bardziej zaawansowane aplikacje webowe, współpracując z klientami i rozwijając swoje umiejętności.",
        "two": "Tworzę responsywne, intuicyjne i estetyczne strony oraz aplikacje internetowe, dbając o każdy szczegół od projektowania interfejsu po wdrożenie gotowego produktu.",
        "three": "Jestem otwarty na nowe wyzwania i chętnie uczę się nowych rzeczy, by stale podnosić swoje umiejętności.",
        "more": "Czytaj więcej ->"
    },
    "projects": {
        "paintedSmile": "Malowany Uśmiech",
        "rockPaper": "Kamień Papier Nożyce",
        "aboutBurrito": "Aplikacja do zamawiania jedzenia z restauracji z funkcjami zakładania konta, edycji profilu i przeglądania historii zamówień.",
        "aboutAcademigo": "Platforma do szukania i oceniania kursów online z różnych serwisów edukacyjnych. Umożliwia zarządzanie kursami oraz kontem we własnym panelu.",
        "aboutMatbud": "Strona internetowa firmy budowlanej z intuicyjnym panelem CMS (Strapi) do łatwego zarządzania treścią. ",
        "aboutSentient": "Strona internetowa dla firmy Sentient, tworzącej inteligentne rozwiązania AI wspierające użytkowników w organizacji pracy. ",
        "aboutGrid": "Frontend strony internetowej dla międzynarodowej firmy z branży kryptowalut, oferującej anonimowe karty płatnicze bez KYC. ",
        "aboutSpend": "Frontend strony internetowej dla klienta zajmującego się globalnymi transakcjami z wykorzystaniem lokalnych rozwiązań płatniczych. ",
        "aboutSolectwo": "Strona internetowa z możliwością dodawania artykułów i zdjęć, wyposażona w customowy panel administracyjny. ",
        "aboutPaplanek": "Aplikacja do komunikacji w czasie rzeczywistym, oferująca live chat, możliwość przesyłania zdjęć oraz tworzenia własnego profilu.",
        "aboutPainted": "Strona internetowa firmy z animacjami dla dzieci, z intuicyjnym interfejsem, informacjami o usługach i galerią zdjęć.",
        "aboutList": "Projekt rekrutacyjny z zarządzaniem stanem aplikacji w Redux, obejmujący obsługę tabeli użytkowników oraz filtrowanie i sortowanie danych.",
        "aboutRide": "Aplikacja do śledzenia codziennych podróży, analizy statystyk i zarządzania danymi, z ograniczonym dostępem.",
        "aboutPortfolio": "Strona portfolio, zawierająca szczegółowe opisy moich projektów, informacje o mnie oraz dane kontaktowe wraz z formularzem. ",
        "aboutEltom": "Strona internetowa firmy elektrycznej, z nowoczesnym designem, informacjami o usługach i formularzem kontaktowym.",
        "aboutExplorer": "Interaktywna aplikacja, która pozwala użytkownikom odkrywać różne kraje na całym świecie.",
        "aboutSpace": "Strona poświęcona podróżom w kosmos, stworzona w ramach praktyki. Zawiera informacje o misjach i technologiach kosmicznych. ",
        "aboutOasis": "Aplikacja do zarządzania cenami  oraz rezerwacjami hotelowymi, wraz z wyświetlaniem statystyk. Opracowana w ramach projektu szkoleniowego. ",
        "aboutRock": "Klasyczna gra w kamień papier nożyce. Wybierz swój ruch i zmierz się z przeciwnikiem w tej prostej, ale wciągającej grze.",
        "viewAll": "Zobacz wszystkie ->",
        "live": "Podgląd ->",
        "livePhone": "Demo ->",
        "code": "Kod ->",
        "alt": "Zdjęcie projektu"
    },

    "skills": {
        "languages": "Języki",
        "frameworks": "Frameworki",
        "tools": "Backend i narzędzia",
        "state": "Stan i dane",
        "styles": "Stylowanie i UI"
    },

    "contact": {
        "contactText": "Masz pytania dotyczące mojej pracy, chcesz nawiązać współpracę lub zatrudnić mnie do swojego projektu? Skontaktuj się ze mną! Chętnie odpowiem na wszelkie pytania.",
        "contactMe": "Napisz do mnie",
        "labelName": "Imię / Nazwa firmy",
        "labelEmail": "Email",
        "labelMessage": "Wiadomość",
        "send": "Wyślij",
        "sending": "Wysyłanie ...",
        "errorName": "Proszę podać imię lub nazwę firmy",
        "errorEmail": "Proszę podać poprawny adres email",
        "errorMessage": "Proszę wprowadzić tekst wiadomości",
        "contactDetails": "Dane kontaktowe"
    },
    "fun": {
        "one": "Kocham włoską kuchnie",
        "two": "Lubię eksperymentować w kuchni",
        "three": "Moim ulubionym filmem jest Incepcja",
        "four": "Lubię rozwiązywać łamigłówki",
        "five": "Lubię majsterkować i naprawiać różne rzeczy",
        "six": "Uwielbiam zwiedzać nowe kraje",
        "seven": "Regularnie jeżdżę na rowerze i gram w piłkę nożną"
    },
    "modal": {
        "success": {
            "title": "Sukces!",
            "message": "Twoja wiadomość została wysłana pomyślnie."
        },
        "error": {
            "title": "Błąd",
            "message": "Nie udało się wysłać Twojej wiadomości. Proszę spróbować ponownie później."
        }
    },
    "cookie": {
        "textOne": "Na stronie wykorzystujemy pliki cookies, aby zbierać dane dotyczące ruchu na stronie.",
        "textTwo": "Więcej informacji znajdziesz w",
        "link": "polityce prywatności",
        "accept": "Akceptuję"
    },
    "errorPage": {
        "title": "Nie znaleziono strony!",
        "link": "<- Przejdź do strony głównej"
    },
    "quotes": {
        "one": {
            "quote": "Kod jest jak humor. Jeśli trzeba go wyjaśniać, jest słaby.",
            "author": "Cory House"
        },
        "two": {
            "quote": "Sukces to suma niewielkich wysiłków powtarzanych dzień po dniu.",
            "author": "Robert Collier"
        },
        "three": {
            "quote": "Doświadczenie to nazwa, którą każdy nadaje swoim błędom.",
            "author": "Oscar Wilde"
        },
        "four": {
            "quote": "Aby być niezastąpionym, trzeba zawsze być innym.",
            "author": "Coco Chanel"
        },
        "five": {
            "quote": "Wybierz pracę, którą kochasz, a nigdy w życiu nie będziesz musiał pracować.",
            "author": "Konfuciusz"
        },
        "six": {
            "quote": "W programowaniu nie chodzi o to, co wiesz, ale o to, co możesz wymyślić.",
            "author": "Chris Pine"
        },
        "seven": {
            "quote": "Uwierz, że możesz, a jesteś w połowie drogi.",
            "author": "Theodore Roosevelt"
        },
        "eight": {
            "quote": "Podróż tysiąca mil zaczyna się od jednego kroku.",
            "author": "Lao Tzu"
        },
        "nine": {
            "quote": "Jeśli potrafisz o czymś marzyć, to potrafisz także tego dokonać.",
            "author": "Walt Disney"
        },
        "ten": {
            "quote": "Porażka jest po prostu okazją, by zacząć od nowa, tym razem mądrzej.",
            "author": "Henry Ford"
        },
        "eleven": {
            "quote": "Jedynym ograniczeniem dla naszej realizacji jutra, są nasze dzisiejsze wątpliwości.",
            "author": "Franklin D. Roosevelt"
        },
        "twelve": {
            "quote": "Żyj tak, jakbyś miał umrzeć jutro. Ucz się tak, jakbyś miał żyć wiecznie.",
            "author": "Mahatma Gandhi"
        }
    }
}
